#include "led.h"

/**************************************************************************
函数功能：LED闪烁
入口参数：1000/闪烁频率 
返回  值：无
**************************************************************************/
void Led_Flash(u8 n,u16 time)
{
	  static int temp;
		if(n==1)
		{
			if(time==0) LED1=0;
			else if(++temp==time){LED1=~LED1,temp=0;}	
		}
		else if(n==2)
		{
			if(time==0) LED2=0;
			else if(++temp==time){LED2=~LED2,temp=0;}	
		}
		else if(n==3)
		{
			if(time==0) BEEP=0;
			else if(++temp==time){BEEP=~BEEP,temp=0;}	
		}
}

/**************************************************************************
函数功能：LED1闪烁
入口参数：1000/闪烁频率 
返回  值：无
**************************************************************************/
void Led1_Flash(u8 n,u16 time)
{
	for(int i=0;i<n;i++)
	{
		LED1_ON;
		HAL_Delay(time);
		LED1_OFF;
		HAL_Delay(time);
	}
}



/**************************************************************************
函数功能：LED2闪烁
入口参数：1000/闪烁频率 
返回  值：无
**************************************************************************/
void Led2_Flash(u8 n,u16 time)
{
	for(int i=0;i<n;i++)
	{
		LED2_TOGGLE;
		HAL_Delay(time);
		LED2_TOGGLE;
	}
}

/**************************************************************************
函数功能：LED3闪烁
入口参数：1000/闪烁频率 
返回  值：无
**************************************************************************/
void Beep_Flash(u8 n,u16 time)
{
	for(int i=0;i<n;i++)
	{
		BEEP_TOGGLE;
		HAL_Delay(time);
		BEEP_TOGGLE;
	}
}
