#include "motor.h"


/**************************************************************************
函数功能：电机初始化函数
入口参数：无
返回  值：无
**************************************************************************/
void Motor_Init(void)
{
	HAL_TIM_PWM_Start(&htim1,TIM_CHANNEL_1);
}


/**************************************************************************
函数功能：限制PWM赋值 
入口参数：无
返回  值：带符号PWM值
**************************************************************************/
int Xianfu_Pwm(int in1)
{	
	  int Amplitude=250;    //===PWM满幅是100  限制在99
	  if(in1<-Amplitude) in1=-Amplitude;	
		if(in1>Amplitude)  in1=Amplitude;		
		return in1;
}


/**************************************************************************
函数功能：PWM赋值函数
入口参数：定时器数，通道数，CCR赋值[正负]
返回  值：无
**************************************************************************/
void Moto_Set_Pwm(TIM_HandleTypeDef*htimx,int channelx,int ccrx)
{
	ccrx=myabs(ccrx);
	__HAL_TIM_SET_COMPARE(htimx,channelx,ccrx);
}


/**************************************************************************
函数功能：绝对值函数
入口参数：int
返回  值：int
**************************************************************************/
int myabs(int a)
{ 		   
	  int temp;
		if(a<0)  temp=-a;  
	  else temp=a;
	  return temp;
}


